{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "923615dc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Список: ['a', 'b', 'F', 't']\n",
      "Введите элемент, индекс которого хотите получить:l\n",
      "Такого элемента в списке нет\n"
     ]
    }
   ],
   "source": [
    "#Составить программу, выдающую индексы заданного элемента или \n",
    "#сообщающую, что такого элемента в списке нет.\n",
    "\n",
    "#!/usr/bin/env python3\n",
    "# -*- coding: utf-8 -*-\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    list = ['a', 'b', 'F', 't']\n",
    "    print(f\"Список: {list}\")\n",
    "    i = input(\"Введите элемент, индекс которого хотите получить:\")\n",
    "    if i in list:\n",
    "        print(f\"Индекс заданного элемента - {i}:[{list.index(i)}]\")\n",
    "    else:\n",
    "        print(\"Такого элемента в списке нет\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "5173fbea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Минимальный по модулю элемент равен: 0\n",
      "Сумма модулей элементов после первого нуля равна: 29\n",
      "Исходный список: [4, 3, 7, 0, -4, -1, 1, 14, -9]\n",
      "Преобразованный список: [3, 0, -1, 14, 4, 7, -4, 1, -9]\n"
     ]
    }
   ],
   "source": [
    "#Список целых чисел, найти минимальный по модулю элемент, сумма модулей, после\n",
    "#первого нуля, преобразовать список, что первая половина были четные позиции, вторая не четные\n",
    "\n",
    "#!/usr/bin/env python3\n",
    "# -*- coding: utf-8 -*-\n",
    "\n",
    "import math\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    list_int_number = [4, 3, 7, 0, -4, -1, 1, 14, -9]\n",
    "    min = abs(list_int_number[0])\n",
    "    for i in range(len(list_int_number)-1):\n",
    "        if min > abs(list_int_number[i+1]):\n",
    "            min = abs(list_int_number[i+1])\n",
    "            \n",
    "    print(f\"Минимальный по модулю элемент равен: {min}\")\n",
    "\n",
    "    null_index = list_int_number.index(0)\n",
    "    list_after_null = list_int_number[null_index:]\n",
    "    sum = 0\n",
    "    for i in range(len(list_after_null)):\n",
    "        sum += abs(list_after_null[i])\n",
    "\n",
    "    print(f\"Сумма модулей элементов после первого нуля равна: {sum}\")\n",
    "\n",
    "    print(f\"Исходный список: {list_int_number}\")\n",
    "    list_chet = list_int_number[1::2]\n",
    "    list_nechet = list_int_number[::2]\n",
    "    new_list = list_chet + list_nechet\n",
    "    print(f\"Преобразованный список:\",new_list)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "46312f5e",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
