{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5e6b6db1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Я\n",
      "о\n",
      "ю\n",
      "у\n",
      "о\n",
      "м\n",
      "о\n",
      "н\n",
      ":\n",
      "е\n",
      "д\n",
      "м\n",
      "й\n",
      "в\n",
      "а\n",
      " \n"
     ]
    }
   ],
   "source": [
    "#Дано предложение. Вывести «столбиком» его третий, шестой и т. д. символы.\n",
    "\n",
    "#!/usr/bin/env python3\n",
    "# -*- coding: utf-8 -*-\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    text = '''Я помню чудное мгновенье:\n",
    "    Передо мной явилась ты'''\n",
    "\n",
    "    for i in text[::3]:\n",
    "        print(i)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "cdf46a78",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Порядковый номер чу:8\n",
      "Порядковый номер щу:25\n"
     ]
    }
   ],
   "source": [
    "#Дано предложение. Определить, есть ли в нем буквосочетания чу или щу. \n",
    "#В случае положительного ответа найти также порядковый номер первой буквы \n",
    "#первого из них.\n",
    "\n",
    "#!/usr/bin/env python3\n",
    "# -*- coding: utf-8 -*-\n",
    "\n",
    "if __name__ == '__main__':\n",
    "\n",
    "    text = 'Я помню чудное мгновенье щу'\n",
    "\n",
    "    if text.find('чу') != -1:\n",
    "        print(f\"Порядковый номер чу:{text.find('чу')}\")\n",
    "    else:\n",
    "        print(\"Буквосочетание 'чу' в тексте нет!\")\n",
    "    if text.find('щу') != -1:\n",
    "        print(f\"Порядковый номер щу:{text.find('щу')}\")\n",
    "    else:\n",
    "        print(\"Буквосочетание 'щу' в тексте нет!\")\n",
    "\n",
    "            "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a23691f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Исходный текст: Привет, мир!\n",
      "Введите букву, которую хотите вставить: д\n",
      "Введите номер места, после которого хотите вставить букву: 3\n",
      "Придвет, мир!\n"
     ]
    }
   ],
   "source": [
    "#Дано слово, оканчивающее символом «.». \n",
    "#Составить программу, которая вставляет некоторую заданную букву \n",
    "#после буквы с заданным номером.\n",
    "\n",
    "#!/usr/bin/env python3\n",
    "# -*- coding: utf-8 -*-\n",
    "\n",
    "if __name__ == '__main__':\n",
    "\n",
    "    text = 'Привет, мир!'\n",
    "    print(f\"Исходный текст: {text}\")\n",
    "    s = input(\"Введите букву, которую хотите вставить: \")\n",
    "    v = int(input(\"Введите номер места, после которого хотите вставить букву: \"))\n",
    "    text = text[:v] + s + text[v:]\n",
    "    print(text)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0e298a73",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
